---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem
source: html/159ecf0e-1c10-84b1-72b8-104a414b76ed.htm
---
# Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem

Represents an analytical system where the air or water is circulated to satisfy building energy requirements.

## Syntax (C#)
```csharp
public class MEPAnalyticalSystem : Element
```